Repository: nhutquangnguyen/style-memory
Catalog: lib/l10n/app_*.arb
Languages: vi

# welcomeTitle
source: Welcome to StyleMemory
vi: Chào mừng đến với StyleMemory

# welcomeSubtitle
source: Capture and remember your clients' unique styles
vi: Lưu giữ và ghi nhớ phong cách độc đáo của khách hàng

source: Get Started
vi: Bắt Đầu

source: Sign In
vi: Đăng Nhập

source: Sign Up
vi: Đăng Ký

source: Password
vi: Mật khẩu

source: Full Name
vi: Họ và Tên

source: Confirm Password
vi: Xác nhận mật khẩu

source: Forgot Password?
vi: Quên mật khẩu?

# dontHaveAccount
source: Don't have an account?
vi: Chưa có tài khoản?

# alreadyHaveAccount
source: Already have an account?
vi: Đã có tài khoản?

source: Create Account
vi: Tạo Tài Khoản

# signInToAccount
source: Sign in to your account
vi: Đăng nhập vào tài khoản của bạn

source: Clients
vi: Khách Hàng

source: Add Client
vi: Thêm Khách Hàng

source: First Name
vi: Tên

source: Last Name
vi: Họ

source: Phone
vi: Điện Thoại

source: Notes
vi: Ghi Chú

source: Save
vi: Lưu

source: Cancel
vi: Hủy

source: Edit
vi: Chỉnh sửa

source: Delete
vi: Xóa

source: visits
vi: lần hẹn

source: New Visit
vi: Lần Hẹn Mới

source: Visit Details
vi: Chi Tiết Lịch Hẹn

source: Date
vi: Ngày

source: Service
vi: Dịch vụ

source: Staff
vi: Nhân viên

source: Rating
vi: Đánh giá

source: Photos
vi: Hình ảnh

# noPhotos
source: No photos available
vi: Không có hình ảnh nào

source: Today
vi: Hôm nay

source: Yesterday
vi: Hôm qua

source: Client
vi: Khách hàng

source: Store Name
vi: Tên Cửa Hàng

source: Address
vi: Địa Chỉ

source: Tap to add
vi: Nhấn để thêm

source: Tap to add store name
vi: Nhấn để thêm tên cửa hàng

# tapToAddPhone
source: Tap to add phone number
vi: Nhấn để thêm số điện thoại

source: Tap to add address
vi: Nhấn để thêm địa chỉ

source: Settings
vi: Cài Đặt

source: Account
vi: Tài Khoản

source: Store Information
vi: Thông Tin Cửa Hàng

source: Management
vi: Quản Lý

source: Staff Management
vi: Quản Lý Nhân Viên

source: Service Management
vi: Quản Lý Dịch Vụ

source: Subscription
vi: Đăng Ký

source: Help & Support
vi: Hỗ Trợ

source: About
vi: Giới Thiệu

# manageTeamMembers
source: Manage your team members
vi: Quản lý thành viên nhóm của bạn

# manageServicesAndPricing
source: Manage your services and pricing
vi: Quản lý dịch vụ và giá cả

source: Current Plan
vi: Gói Hiện Tại

source: Free Plan
vi: Gói Miễn Phí

source: Manage Subscription
vi: Quản Lý Đăng Ký

source: FAQ
vi: Câu Hỏi Thường Gặp

source: Contact Support
vi: Liên Hệ Hỗ Trợ

# howToUse
source: How to Use StyleMemory
vi: Hướng Dẫn Sử Dụng StyleMemory

source: Privacy Policy
vi: Chính Sách Bảo Mật

source: Terms of Service
vi: Điều Khoản Dịch Vụ

source: App Version
vi: Phiên Bản Ứng Dụng

source: Sign Out
vi: Đăng Xuất

source: Edit Store Name
vi: Chỉnh Sửa Tên Cửa Hàng

source: Edit Phone Number
vi: Chỉnh Sửa Số Điện Thoại

source: Edit Address
vi: Chỉnh Sửa Địa Chỉ

# enterStoreName
source: Enter your store name
vi: Nhập tên cửa hàng của bạn

source: Enter phone number
vi: Nhập số điện thoại

# enterAddress
source: Enter your store address
vi: Nhập địa chỉ cửa hàng của bạn

# storeNameUpdated
source: Store name updated successfully
vi: Cập nhật tên cửa hàng thành công

# phoneNumberUpdated
source: Phone number updated successfully
vi: Cập nhật số điện thoại thành công

# addressUpdated
source: Address updated successfully
vi: Cập nhật địa chỉ thành công

source: Failed to update store name
vi: Không thể cập nhật tên cửa hàng

source: Failed to update phone number
vi: Không thể cập nhật số điện thoại

source: Failed to update address
vi: Không thể cập nhật địa chỉ

source: Loved Styles
vi: Phong Cách Yêu Thích

source: Gallery
vi: Thư Viện

source: Capture
vi: Chụp Ảnh

source: New Photos
vi: Ảnh Mới

source: Select Photos
vi: Chọn Ảnh

source: Share Photos
vi: Chia Sẻ Ảnh

source: Delete Photos
vi: Xóa Ảnh

source: Visit Not Found
vi: Không Tìm Thấy Lịch Hẹn

source: Client Not Found
vi: Không Tìm Thấy Khách Hàng

source: Staff not found
vi: Không tìm thấy nhân viên

source: Service selected
vi: Đã chọn dịch vụ

source: Styling session
vi: Buổi làm tóc

source: Total Clients
vi: Tổng Số Khách Hàng

source: Total Photos
vi: Tổng Số Ảnh

source: Storage Usage
vi: Sử Dụng Bộ Nhớ

source: Coming soon
vi: Sắp ra mắt

source: Frequently Asked Questions
vi: Câu Hỏi Thường Gặp

source: How to Use StyleMemory
vi: Hướng Dẫn Sử Dụng StyleMemory

source: Close
vi: Đóng

source: Got it
vi: Đã hiểu

# confirmSignOut
source: Are you sure you want to sign out?
vi: Bạn có chắc chắn muốn đăng xuất?

# confirmDelete
source: Are you sure you want to delete?
vi: Bạn có chắc chắn muốn xóa?

source: This action cannot be undone
vi: Hành động này không thể hoàn tác

source: Loading...
vi: Đang tải...

source: Error
vi: Lỗi

source: Retry
vi: Thử lại

source: Language
vi: Ngôn Ngữ

source: Select Language
vi: Chọn Ngôn Ngữ

# languageUpdated
source: Language updated successfully
vi: Cập nhật ngôn ngữ thành công

# photosSelected
source: {count} photo{count, plural, =1{} other{s}} selected
vi: Đã chọn {count} ảnh

# daysAgo
source: {count} day{count, plural, =1{} other{s}} ago
vi: {count} ngày trước

# weeksAgo
source: {count} week{count, plural, =1{} other{s}} ago
vi: {count} tuần trước

# monthsAgo
source: {count} month{count, plural, =1{} other{s}} ago
vi: {count} tháng trước

# enterYourEmail
source: Enter your email address
vi: Nhập địa chỉ email của bạn

source: Enter your password
vi: Nhập mật khẩu của bạn

# emailRequired
source: Email is required
vi: Email là bắt buộc

# passwordRequired
source: Password is required
vi: Mật khẩu là bắt buộc

# pleaseEnterValidEmail
source: Please enter a valid email address
vi: Vui lòng nhập địa chỉ email hợp lệ

source: Create one
vi: Tạo tài khoản

# forgotPasswordFeature
source: Forgot password feature coming soon
vi: Tính năng quên mật khẩu sắp ra mắt

source: Creating account...
vi: Đang tạo tài khoản...

# chooseSecurePassword
source: Choose a secure password
vi: Chọn mật khẩu an toàn

source: Full Name (optional)
vi: Họ và Tên (tùy chọn)

source: Enter your full name
vi: Nhập họ và tên của bạn

# passwordMustBe6Characters
source: Password must be at least 6 characters
vi: Mật khẩu phải có ít nhất 6 ký tự

source: Your Clients
vi: Khách Hàng Của Bạn

# searchByNamePhoneEmail
source: Search by name, phone, or email...
vi: Tìm kiếm theo tên, số điện thoại hoặc email...

source: Search Results
vi: Kết Quả Tìm Kiếm

source: All Clients
vi: Tất Cả Khách Hàng

source: found
vi: tìm thấy

source: total
vi: tổng cộng

source: No clients found
vi: Không tìm thấy khách hàng

# tryAdjustingSearch
source: Try adjusting your search terms or add a new client.
vi: Thử điều chỉnh từ khóa tìm kiếm hoặc thêm khách hàng mới.

source: Clear Search
vi: Xóa Tìm Kiếm

source: Welcome to Style Memory!
vi: Chào mừng đến với Style Memory!

# startByAddingFirstClient
source: Start by adding your first client to track their styles, preferences, and visit history.
vi: Bắt đầu bằng cách thêm khách hàng đầu tiên để theo dõi phong cách, sở thích và lịch sử hẹn của họ.

source: Add Your First Client
vi: Thêm Khách Hàng Đầu Tiên

source: visit
vi: lần hẹn

source: Last visit
vi: Lần hẹn cuối

source: No visits yet
vi: Chưa có lần hẹn nào

# startByCaptureFirstVisit
source: Start by capturing photos for {clientName}'s first visit
vi: Bắt đầu bằng cách chụp ảnh cho lần hẹn đầu tiên của {clientName}

source: New Client
vi: Khách Hàng Mới

source: Creating client...
vi: Đang tạo khách hàng...

source: Client Name
vi: Tên Khách Hàng

# enterClientFullName
source: Enter client's full name
vi: Nhập họ và tên khách hàng

source: Phone (optional)
vi: Điện thoại (tùy chọn)

source: Email (optional)
vi: Email (tùy chọn)

source: Enter email address
vi: Nhập địa chỉ email

# clientNameRequired
source: Client name is required
vi: Tên khách hàng là bắt buộc

# pleaseEnterValidPhoneNumber
source: Please enter a valid phone number
vi: Vui lòng nhập số điện thoại hợp lệ

# saveAndAddPhotos
source: Save & Add Photos
vi: Lưu và Thêm Ảnh

# afterSavingCanCapturePhotos
source: After saving, you'll be able to capture photos for this client's first visit.
vi: Sau khi lưu, bạn sẽ có thể chụp ảnh cho lần hẹn đầu tiên của khách hàng này.

# addPhotosAndNotes
source: Add Photos & Notes
vi: Thêm Ảnh & Ghi Chú

source: Staff Member
vi: Nhân Viên

source: Select staff member
vi: Chọn nhân viên

source: Service Type
vi: Loại Dịch Vụ

source: Select service type
vi: Chọn loại dịch vụ

source: Visit Notes
vi: Ghi Chú Lần Hẹn

# addNotesAboutService
source: Add notes about the service, products used, client preferences, etc...
vi: Thêm ghi chú về dịch vụ, sản phẩm sử dụng, sở thích khách hàng, v.v...

# addPhotosToDocument
source: Add photos to document this visit
vi: Thêm ảnh để ghi lại lần hẹn này

# onePhotoSelected
source: 1 photo selected
vi: Đã chọn 1 ảnh

# photosSelectedCount
source: {count} photos selected
vi: Đã chọn {count} ảnh

source: Camera
vi: Máy Ảnh

source: Save Visit
vi: Lưu Lần Hẹn

source: Saving Visit...
vi: Đang lưu lần hẹn...

source: Camera error
vi: Lỗi máy ảnh

source: Gallery error
vi: Lỗi thư viện

# pleaseAddPhotoOrNotes
source: Please add at least one photo or some notes
vi: Vui lòng thêm ít nhất một ảnh hoặc một số ghi chú

source: Visit saved successfully!
vi: Lưu lần hẹn thành công!

# errorSavingVisit
source: Error saving visit: {error}
vi: Lỗi khi lưu lần hẹn: {error}

source: Recent
vi: Gần Đây

source: Loved
vi: Yêu Thích

# dateColon
source: Date:
vi: Ngày:

# serviceColon
source: Service:
vi: Dịch vụ:

# staffColon
source: Staff:
vi: Nhân viên:

# ratingColon
source: Rating:
vi: Đánh giá:

source: Edit Client
vi: Chỉnh Sửa Khách Hàng

source: Delete Client
vi: Xóa Khách Hàng

source: Search by notes or service
vi: Tìm kiếm theo ghi chú hoặc dịch vụ

source: Enter search terms...
vi: Nhập từ khóa tìm kiếm...

source: All Services
vi: Tất Cả Dịch Vụ

source: Clear Filters
vi: Xóa Bộ Lọc

source: Search by client name
vi: Tìm kiếm theo tên khách hàng

source: Enter client name...
vi: Nhập tên khách hàng...

# clientColon
source: Client:
vi: Khách hàng:

# photosColon
source: Photos:
vi: Hình ảnh:

# notesColon
source: Notes:
vi: Ghi chú:

source: Phone Number
vi: Số Điện Thoại

source: Add Staff Member
vi: Thêm Nhân Viên

source: Specialty
vi: Chuyên Môn

source: Add
vi: Thêm

source: General Stylist
vi: Stylist Tổng Hợp

source: Joined
vi: Tham Gia

source: New hire
vi: Nhân viên mới

source: Add Service
vi: Thêm Dịch Vụ

source: Service Name
vi: Tên Dịch Vụ

source: Enter service name
vi: Nhập tên dịch vụ

source: No staff members yet
vi: Chưa có nhân viên nào

# addFirstTeamMember
source: Add your first team member to get started
vi: Thêm thành viên đầu tiên vào nhóm của bạn

# staffDetailsComingSoon
source: Staff details for {staffName} coming soon
vi: Chi tiết nhân viên cho {staffName} sắp ra mắt

source: Remove Staff Member
vi: Xóa Nhân Viên

# confirmRemoveStaff
source: Are you sure you want to remove {staffName} from your team? They will be marked as inactive but their work history will be preserved.
vi: Bạn có chắc chắn muốn xóa {staffName} khỏi nhóm của bạn? Họ sẽ được đánh dấu là không hoạt động nhưng lịch sử làm việc của họ sẽ được giữ lại.

source: Remove
vi: Xóa

# staffRemovedFromTeam
source: {staffName} removed from team
vi: {staffName} đã bị xóa khỏi nhóm

source: Staff Analytics
vi: Phân Tích Nhân Viên

source: Total Staff
vi: Tổng Số Nhân Viên

source: Active Staff
vi: Nhân Viên Đang Hoạt Động

source: Inactive Staff
vi: Nhân Viên Không Hoạt Động

source: Edit Staff Member
vi: Chỉnh Sửa Nhân Viên

source: Enter staff member name
vi: Nhập tên nhân viên

# nameRequired
source: Name is required
vi: Tên là bắt buộc

# specialtyHint
source: e.g., Hair Color Specialist, Nail Art
vi: ví dụ: Chuyên gia nhuộm tóc, Nghệ thuật nail

# staffEmailHint
source: staff@salon.com
vi: nhanvien@salon.com

source: Additional information...
vi: Thông tin bổ sung...

source: Update
vi: Cập nhật

# staffUpdatedSuccessfully
source: {staffName} updated successfully
vi: {staffName} đã được cập nhật thành công

# staffAddedToTeam
source: {staffName} added to your team
vi: {staffName} đã được thêm vào nhóm của bạn

source: Show All Staff
vi: Hiển Thị Tất Cả Nhân Viên

source: No services yet
vi: Chưa có dịch vụ nào

# addFirstService
source: Add your first service to get started
vi: Thêm dịch vụ đầu tiên của bạn để bắt đầu

source: Show All Services
vi: Hiển Thị Tất Cả Dịch Vụ

source: Service Analytics
vi: Phân Tích Dịch Vụ

source: Total Services
vi: Tổng Số Dịch Vụ

source: Active Services
vi: Dịch Vụ Đang Hoạt Động

source: Inactive Services
vi: Dịch Vụ Không Hoạt Động

source: Edit Service
vi: Chỉnh Sửa Dịch Vụ

source: Service added successfully
vi: Dịch vụ đã được thêm thành công

source: Service updated successfully
vi: Dịch vụ đã được cập nhật thành công

source: Delete Service
vi: Xóa Dịch Vụ

# confirmDeleteService
source: Are you sure you want to delete "{serviceName}"? This action cannot be undone.
vi: Bạn có chắc chắn muốn xóa "{serviceName}"? Hành động này không thể hoàn tác.

source: Service deleted successfully
vi: Dịch vụ đã được xóa thành công

# pleaseEnterServiceName
source: Please enter a service name
vi: Vui lòng nhập tên dịch vụ

source: Time
vi: Thời gian

source: Products Used
vi: Sản phẩm đã sử dụng

source: Edit Visit
vi: Chỉnh Sửa Lần Hẹn

source: Delete Visit
vi: Xóa Lần Hẹn

source: Visit updated successfully
vi: Lần hẹn đã được cập nhật thành công
